Autodesk.Revit.DB.IFC.ImporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
Sets the handle to the IFC file being created during this import operation.
file:
The handle to the file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject(Autodesk.Revit.DB.IFC.IFCAnyHandle,System.Collections.Generic.IDictionary`2{Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.ElementId})
The entry point to the native IFC import function.  Processes the main IfcProject and creates appropriate Revit elements.
Remarks:
This function allows for a "hybrid" .NET/native import.  For any handle below, there will be no native processing,
and it will be assumed that the element created in .NET is valid and appropriate.  Note that this is only applicable
for IFCAnyHandles that are subtypes of IfcProduct and IfcBuildingElementStorey; other handles will be ignored.
Also, note that some elements have interdependencies that are not yet handled by this function.  These include:
1. IfcDoor/IfcWindow and their IfcOpeningElements and 2D representations should both be created in the same environment (.NET or native).
2. Symbols and their instances should both be created in the same environment (.NET or native).
ifcProject:
The IfcProject containing the entities in the IFC file.
createdElements:
The element ids for the already created elements.  These handles will not be processed in native code.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.IFC.ImporterIFC.ProcessIFCProject(Autodesk.Revit.DB.IFC.IFCAnyHandle)
The entry point to the native IFC import function.  Processes the main IfcProject and creates appropriate Revit elements.
ifcProject:
The IfcProject containing the entities in the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014